short //定义变量，给变量开2个字节的空间
int  //定义变量，给变量开4个字节的空间
long //定义变量，给变量开4个字节的空间
long long  //定义变量，给变量开8个字节的空间
bool  //定义真假，只包含两个数，0和1，比0大的数是真 输出1，等于0的数是假，输出0；
char  //定义字符
float //定义一个浮点数，精确到小数定后7位
double //定义一个浮点数，精确到小数点后14位
int main()   //系统的主函数
return 0;    //返回语句，如果返回0则表示结束，return 后的数可以改返回值，在函数中会用到
while ()    //循环  括号里循环几次自己定
for (i = 1; i <= 10; i++)  //循环，第一个i是指从i开始，第二个i是指循环到10，最后i++是指从1开始，每次加1；
//这种形式循环前要定义一个变量i
for (int i = 1; i <= 10; i++)//这种形式不用再前面定义，因为它直接在循环里定义了

do
{

} while ();// 这个循环是指先运行一遍，如果满足while()里的条件，在循环，所以，用这个语句，循环次数要比题目要求少1次

cin >> ;   //输出变量 两个大于号后面填一之前输入的一个变量，跟c语言的scanf("%d",& )作用一样
cout << ; //指输出小于号后面的变量
cout << endl;//表示换行

const int;  //定义一个常量，这个量不能改，一改就错，const后的int可以改成任何定义类别
